package SparkSQL

import org.apache.spark.sql.SQLContext
import org.apache.spark.{SparkContext, SparkConf}

/**
  * Created by Administrator on 2016/6/17.
  */
object DataFrame {
  def main(args:Array[String]): Unit ={

    // 0 初始化环境配置
    val conf = new SparkConf().setAppName("zkjz_df_hjr")
    val sc = new SparkContext(conf)
    val sqlContext = new SQLContext(sc)

    // 1 加载数据文件 --- 中国 A 股上市公司基本信息
    val df = sqlContext.read.json("/user/houjr/data/stock_5.json")

    // 2 - 1打印 DataFrame 的 Schema
    df.printSchema()
    /*root
    |-- ListSector: string (nullable = true)
    |-- closePrice: double (nullable = true)
    |-- dealAmount: long (nullable = true)
    |-- exchangeCD: string (nullable = true)
    |-- highestPrice: double (nullable = true)
    |-- isOpen: long (nullable = true)
    |-- listDate: string (nullable = true)
    |-- lowestPrice: double (nullable = true)
    |-- marketValue: double (nullable = true)
    |-- negMarketValue: double (nullable = true)
    |-- openPrice: double (nullable = true)
    |-- preClosePrice: double (nullable = true)
    |-- secID: string (nullable = true)
    |-- secShortName: string (nullable = true)
    |-- ticker: string (nullable = true)
    |-- totalShares: long (nullable = true)
    |-- tradeDate: string (nullable = true)
    |-- turnoverValue: double (nullable = true)*/
    // 2 - 2打印数据(默认显示20行数据)
    df.show()
    /*+----------+----------+----------+----------+------------+------+----------+-----------+---------------+----------------+---------+-------------+-----------+------------+------+-----------+----------+---------------+
    |ListSector|closePrice|dealAmount|exchangeCD|highestPrice|isOpen|  listDate|lowestPrice|    marketValue|  negMarketValue|openPrice|preClosePrice|      secID|secShortName|ticker|totalShares| tradeDate|  turnoverValue|
    +----------+----------+----------+----------+------------+------+----------+-----------+---------------+----------------+---------+-------------+-----------+------------+------+-----------+----------+---------------+
    |        主板|      10.7|     19661|      XSHE|        10.7|     1|1991-04-03|      10.47|1.5310283534E11| 1.2630338422E11|    10.48|        10.43|000001.XSHE|        平安银行|000001|14308676200|2016-03-30| 5.7262741713E8|
      |        主板|     24.43|         0|      XSHE|         0.0|     0|1991-01-29|        0.0|2.6968599476E11|2.37174448154E11|      0.0|        24.43|000002.XSHE|         万科A|000002|11039132000|2016-03-30|            0.0|
      |        主板|     36.83|         0|      XSHE|         0.0|     0|1991-01-14|        0.0|  3.092861861E9|   3.089134665E9|      0.0|        36.83|000004.XSHE|        国农科技|000004|   83976700|2016-03-30|            0.0|
      |        主板|      7.72|     14126|      XSHE|        7.78|     1|1990-12-10|        7.5|  8.171904096E9|    7.05409596E9|     7.52|         7.48|000005.XSHE|        世纪星源|000005| 1058536800|2016-03-30| 1.5927863966E8|
      |        主板|      8.34|      7058|      XSHE|        8.35|     1|1992-04-27|       8.16|1.1258959134E10| 1.1177819274E10|     8.18|         8.11|000006.XSHE|        深振业A|000006| 1349995100|2016-03-30| 1.6148039693E8|
      |        主板|     23.79|         0|      XSHE|         0.0|     0|1992-04-13|        0.0|  5.494664487E9|   4.898054109E9|      0.0|        23.79|000007.XSHE|         全新好|000007|  230965300|2016-03-30|            0.0|
      |        主板|     11.02|     17777|      XSHE|        11.1|     1|1992-05-07|      10.57|3.0389956486E10| 1.4553099058E10|    10.57|        10.54|000008.XSHE|        神州高铁|000008| 2757709300|2016-03-30| 2.8906064027E8|
      |        主板|     13.94|     59211|      XSHE|       13.94|     1|1991-06-25|      13.16|2.2193977156E10| 2.1678927612E10|    13.39|        13.18|000009.XSHE|        中国宝安|000009| 1592107400|2016-03-30|1.47993414888E9|
      |        主板|      8.43|      4843|      XSHE|        8.46|     1|1995-10-27|       8.21|  6.911375121E9|   3.438849057E9|     8.28|          8.2|000010.XSHE|         深华新|000010|  819854700|2016-03-30|  8.075860872E7|
      |        主板|      14.0|      9345|      XSHE|        14.0|     1|1992-03-30|      13.51|    8.3437074E9|     2.4620764E9|    13.63|        13.46|000011.XSHE|        深物业A|000011|  595979100|2016-03-30| 1.4534532003E8|
      |        主板|     10.56|      9436|      XSHE|       10.58|     1|1992-02-28|      10.28|2.1915543936E10| 1.3770999264E10|    10.29|        10.21|000012.XSHE|         南玻A|000012| 2075335600|2016-03-30| 1.3852006732E8|
      |        主板|      17.9|      3026|      XSHE|       17.99|     1|1992-06-02|      17.47|   3.61052308E9|    3.61052308E9|    17.62|        17.36|000014.XSHE|        沙河股份|000014|  201705200|2016-03-30|  6.638818219E7|
      |        主板|       5.1|         0|      XSHE|         0.0|     0|1992-03-27|        0.0| 1.228052154E10|    8.14262838E9|      0.0|          5.1|000016.XSHE|        深康佳A|000016| 2407945400|2016-03-30|            0.0|
      |        主板|     12.39|      6463|      XSHE|        12.5|     1|1992-03-31|       12.0|  6.831200481E9|   3.753907332E9|    12.05|         11.9|000017.XSHE|        深中华A|000017|  551347900|2016-03-30|  1.081621031E8|
      |        主板|      51.4|     19679|      XSHE|        52.1|     1|1992-06-16|      48.08| 2.297099924E10|     5.1256337E9|    48.68|         48.7|000018.XSHE|        神州长城|000018|  446906600|2016-03-30| 5.7392902227E8|
      |        主板|      17.5|     21036|      XSHE|       17.54|     1|1992-10-12|      16.96|    5.2689035E9|      4.414417E9|     17.2|         17.0|000019.XSHE|        深深宝A|000019|  301080200|2016-03-30| 3.5265309616E8|
      |        主板|     24.34|      9407|      XSHE|        24.5|     1|1992-04-28|      23.13|  6.892143608E9|   4.409565836E9|    23.18|        23.13|000020.XSHE|        深华发A|000020|  283161200|2016-03-30| 1.4890860399E8|
      |        主板|      9.37|     23261|      XSHE|        9.38|     1|1994-02-02|       9.08|1.3785700578E10| 1.3772160928E10|     9.19|          9.1|000021.XSHE|         深科技|000021| 1471259400|2016-03-30| 3.8362678406E8|
      |        主板|     17.06|      3798|      XSHE|       17.12|     1|1993-05-05|      16.69|1.0999668722E10|    7.93063102E9|    16.69|        16.58|000022.XSHE|        深赤湾A|000022|  644763700|2016-03-30|  7.031680202E7|
      |        主板|     30.53|         0|      XSHE|         0.0|     0|1993-04-29|        0.0|  4.236226786E9|   4.236226786E9|      0.0|        30.53|000023.XSHE|        深天地A|000023|  138756200|2016-03-30|            0.0|
      +----------+----------+----------+----------+------------+------+----------+-----------+---------------+----------------+---------+-------------+-----------+------------+------+-----------+----------+---------------+
    only showing top 20 rows*/

    // 3 操作DataFrame
    df.registerTempTable("stock")

    sqlContext.sql("select * from stock").show(5)


  }
}
